{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"There’s this funny thing about life, you never know where it’s gonna take you. Whatever the ups and downs, in the end always remember that: Life is a journey, not a destination When I was growing up I was fiddling a lot with computers and not just to play StarCraft, Warcraft and Diablo but I also  really enjoyed building things . Among some of the ones “worth” mentioning are: StarCraft…","id":"93905e04-2e0a-523d-83a0-05003f5042db","timeToRead":8,"frontmatter":{"date":"Jan 21, 2018","path":"/general/how-i-got-into-software-development","title":"How I got into software development","author":"Georgi Yanev","tags":"general","ogImage":{"publicURL":"/static/how-i-got-into-software-development-1-2097ab6aab8c0bf9478fca6f07795f8b.png"}}}},{"node":{"excerpt":"It’s that time of the year again. The best time to recap and consider how the year has passed. For one I really like making a goal list each year and then checking against it how I’d done. How I have accomplished certain goals and moved past others that I deem no longer high priority and worthy of the time investment. I’m sure this is a very personal matter how you like tracking (or not…","id":"f77a851f-b23a-5b55-9a43-d48862e1bfd0","timeToRead":6,"frontmatter":{"date":"Dec 22, 2017","path":"/general/recap-of-2017-and-goals-for-2018","title":"Recap of 2017 and Goals for 2018 🎉","author":"Georgi Yanev","tags":"general","ogImage":{"publicURL":"/static/recap-2017-and-goals-for-2018-1-f4fe1675a1c7a3cbcd0a03c6d403ac7a.png"}}}},{"node":{"excerpt":"In this blog post I will share my experience and learnings from living in a smart home for a year. Before we get started, however, let’s get some things out of the way in the form of a disclaimer list: this is not going to be a guide this article probably conveys plenty of intentional Home Assistant bias <3 this was not a full out smart home revamp but rather retro fitting and…","id":"234e1e30-85f7-5658-9672-5dd356128e70","timeToRead":10,"frontmatter":{"date":"Nov 11, 2017","path":"/smart-home/living-with-smart-home-automation","title":"Living with smart home automation for a year","author":"Georgi Yanev","tags":"smart home","ogImage":{"publicURL":"/static/living-in-a-smart-home-271f9d1921251db241f86be2f48309dc.png"}}}}]}},"pageContext":{}}