{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Examination details for the Blockchain module The list of reading material is the Blockchain: Reading List. In addition, you have the lecture notes and the assignments. In the examination of the Blockchain module, you will draw and answer 2 questions. The first question The first question will be about a general blockchain topic (from the lectures / books). You will get one (randomly…","id":"99acd311-75e8-547c-9bc1-a872f25bde49","timeToRead":1,"frontmatter":{"date":"Nov 23, 2018","path":"/blockchain/blockchain","title":"Blockchain","author":"Kristoffer-Andre Kalliainen","tags":"blockchain"}}},{"node":{"excerpt":"Hill Cipher Polyalphabetic cipher Requires at least 2 keys Uses a linear combination of the key with the plaintext to form the ciphertext.","id":"e6a38637-90c5-503c-8560-e602ad330b21","timeToRead":1,"frontmatter":{"date":"Nov 23, 2018","path":"/cryptography/hill-cypher","title":"Affine Cypher","author":"Kristoffer-Andre Kalliainen","tags":"cryptography"}}},{"node":{"excerpt":"Affine Cypher Think about how to decrypt the Affine Cipher Decryption Inverse’of’multiplicative’cipher How to compute the inverse of a key (Trial and Error Approach Exercise Decryption Computational effort to break Affine Cipher $$12  *  26 = 312$$ Brute-force 312 keys. Cryptoanalysis o Affine Cipher The Affine cipher incresed the key space over shift cipher However, it is still…","id":"de181ee7-6ad0-5744-a9d7-f1f7eefa8d4e","timeToRead":1,"frontmatter":{"date":"Nov 23, 2018","path":"/cryptography/affine-cypher","title":"Affine Cypher","author":"Kristoffer-Andre Kalliainen","tags":"cryptography"}}},{"node":{"excerpt":"Examination details for Basic Cryptography Module Reading Lists for the Exam Lecture Notes http://www.tutorialspoint.com/cryptography/ Exam structure No hard calculations!!! Come with your pen, pencil & erasers 3 parts with different weights. Parts 1 and 2 are the most important. Part 1.Definitions and concepts Show understanding of the different crypto algorithms and concepts under…","id":"9c9b6ab5-5f44-5a42-a139-3c7f008ac747","timeToRead":1,"frontmatter":{"date":"Nov 23, 2018","path":"/cryptography/cryptography","title":"Examination details for Basic Cryptography Module","author":"Kristoffer-Andre Kalliainen","tags":"cryptography"}}},{"node":{"excerpt":"Examination details for the Refactoring module Reading List As per  Reading List  on Refactoring. Remember to look at the work on refactoring C/C++. Exam Question There will only be time for 2-3 questions per module. We will discuss a randomly selected refactoring first. After that, we will discuss a secondary topic (on smells or metrics), but depending on the refactoring we discuss in…","id":"dd314fc7-d3db-509e-9fb8-1a4dd4b88f85","timeToRead":1,"frontmatter":{"date":"Nov 23, 2018","path":"/refactoring/refactoring","title":"Refactoring","author":"Kristoffer-Andre Kalliainen","tags":"refactoring"}}}]}},"pageContext":{}}