{"data":{"markdownRemark":{"html":"<h2>How is a payment carried out in the Bitcoin network?</h2>\n<p>The bitcoin network is based on blocks. Blocks are discovered by attempting to solve complex mathematical problems using huge computational resources.</p>\n<p>Once a block is “discovered”, the block is validated by consensus of peers in the network. They will adopt the new block.</p>\n<p>The node that discovers the block will get a reward, but it will also be allowed to fill the block with transactions. All transactions will need to be validated by tracing the origin of all the earlier bitcoin transactions.</p>\n<p>The discoverer will stand to gain to have a valid block, if it gets rejected, it will not get the block reward from the blockchain. Once a block is signed and adopted, it will be “set in stone”.</p>\n<p>If you want to do a transaction, you have to decide which amount to\nsend, and who to send it to.</p>\n<p>You must have a unspent transaction of at least that size, or you might need to make two transactions. It’s possible to get change.</p>\n<p>You must input the address of the wallet you want to send the Bitcoin to, and sign it with your private key.</p>\n<p>It might take a long time before the transaction will be carried out, as you need to wait to get your transaction included in a discovered block.</p>\n<p><strong>A rough overview of the process to mine bitcoins is:</strong></p>\n<ol>\n<li>New transactions are broadcast to all nodes.</li>\n<li>Each miner node collects new transactions into a block.</li>\n<li>Each miner node works on finding a proof-of-work code for its block.</li>\n<li>When a node finds a proof-of-work, it broadcasts the block to all nodes.</li>\n<li>Receiving nodes validate the transactions it holds and accept only if all are valid.</li>\n<li>Nodes express their acceptance by moving to work on the next block, incorporating the hash of the accepted block.</li>\n</ol>\n<h2>What is distributed consensus?</h2>\n<p>Bitcoin is completely ground breaking in the way that it has an effective system of distributed consensus.</p>\n<p>In order to poison the blockchain, you must control at least 50% of the nodes.</p>\n<p>This represents a huge amount of computational power, but it will be easily possible to attain with smaller currencies, if big organisations would switch to mining that coin for a small while.</p>\n<p>However, you stand to gain from being honest.</p>\n<p>If you discover a new valid block, if you attempt to fill it with malicious transactions, it will get rejected from the rest of the network, and you will be financially disincentivized to do so.</p>\n<p>In comparison, with other types of verification, you need a trusted party, an intermediate who vouches for the validity of something.</p>\n<p>In example a CA validating an SSL cert, your bank approving your transactions, or the Norwegian government vouching for the authenticity of a passport.</p>\n<p>Now a big group of people have to attain a consensus.</p>\n<p>This is not new, and by itself having a financial incentive for being honest will not guarantee you from dishonest behaviour, but it works in practice.</p>\n<h2>What is known as the biggest risk of distributed consensus?</h2>\n<h2>What is a blockchain?</h2>\n<p>A blockchain is a chain of blocks.</p>\n<p>You can perhaps think of it as a linked list of data.\nA block is an array of transactions.</p>\n<p>The first transaction has no proper sender, it is awarded from the blockchain to whatever wallet you like, if you discovered the block.\nThe rest are transactions you wish to include.</p>\n<p>The transactions must be properly signed by the respective senders and can thus not be made up. The authenticity of this is verified by by consensus of peers in the network.</p>\n<p>Bitcoin is anonymous, yes, but at the same time completely transparent. In order to verify that a transaction is valid you must follow pointers to an older block and location where the bitcoin was earlier transacted.</p>\n<p>This list is huge. Therefore a simplified “UTXO”, unspent transactions outputs list is provided by the network. If the transaction is in this list, it can be spent in a new transaction.\nThe blocks are of course distributed by a P2P protocol and are completely decentralised.</p>\n<h2>What is scripts and smart contracts?</h2>\n<p>Bitcoin has it’s own simple scripting language, simply called Script. It’s a stack based language with no loops.\nIt’s used for transactions, and must contain at minimum a pub key that leads to the wallet ID of the recipient,\nand must be signed by ta private key that proves that you are the one who generated this pub key.</p>\n<p>Smart contracts are variations of scripts, that can be used to do stuff other than to perform transactions.\nThink “If this, then that”, with the final result being the bitcoin becoming available for the recipient.\nIf a smart contract is signed, the transaction will be carried out whenever the parameters are met. It can be anything, at a certain time or when other parameters are met.</p>\n<p>There are examples in the material provided that gives ideas of selling things like cars and houses without the need for a broker such as a bank.</p>\n<h2>How does blockchain scale and how fast is it?</h2>\n<p>Bitcoin has in total 21M discoverable coins, and the network is made so that the more coins are discovered, the more effort is needed in order to discover a new block. The algorithm gets harder.</p>\n<p>Thus, at some point, the capital cost of hardware and electricity will surpass the market value of what is generated.</p>\n<p>As we are now at under 4k USD per coin, this point is probably already here, at the very least for home miners.\nPower needed in order to carry out one transaction will dramatically increase, and also the transaction time will increase if computational power is not added to the network proportionally.</p>\n<h2>What applications / use cases is there for blockchain?</h2>\n<p>As a fiat digital currency (Cons, bad scaling, pros no intermediate, web of trust that works, anonymous, not controllable by any actor).\nWith smart contracts, facilitating agreements where all the nodes are witnesses, and will be fulfilled if the requirements are met.</p>\n<h2>Supply chain management:</h2>\n<p>Blockchain coins can easily be traced, and thus can be traced back to it’s origins easily. This can aid to combat corruption and bad ethics.</p>\n<h2>Digital identity</h2>\n<p>You can have a digitally signed identity that is verified by consensus.</p>\n<p>Other: Patient information, electrical market</p>\n<h2>What are inputs and outputs?</h2>\n<h2>What are transactions, signing, validation?</h2>\n<h2>What is private key, public key, address and signature?</h2>\n<h2>What is hashing used for?</h2>\n<h2>What is the UTXO-set?</h2>\n<h2>What is mining, nonce and “target”?</h2>\n<h2>What is the difference between PoW and PoS?</h2>\n<h2>What is the consequence if a block on the chain is altered after it’s been added?</h2>\n<hr>","excerpt":"How is a payment carried out in the Bitcoin network? The bitcoin network is based on blocks. Blocks are discovered by attempting to solve…","frontmatter":{"date":"December 03, 2018","dateUnformatted":"2018-12-03","path":"/questions/blockchain","title":"Blockchain Questions","tags":"questions","author":"Kristoffer-Andre Kalliainen, Vegard Guttormsen and Preben Haukebøe","ogDescription":"Blockchain Questions"}}},"pageContext":{}}