{"data":{"markdownRemark":{"html":"<h2>Internet of Things (IoT) / Web of Things (WoT)</h2>\n<ol>\n<li>Describe an example of an IoT system in witch information and knowledge are inferred from data.</li>\n<li>Why do IoT systems have to be self-adapting and self-configuring?</li>\n<li>What is the role of things and Internet in IoT?</li>\n<li>What is the cuntion of communication funtional block in an IoT system?</li>\n<li>Describe an exampe of IoT service that uses publish-subscribe communication model.</li>\n<li>Describe an example of IoT service that uses WebSocked-based communication.</li>\n<li>What are the architectural constraints of REST?</li>\n<li>What is the role of a coordinator in wireless sensor network?</li>\n<li>What is the role of a controller service in an IoT system?</li>\n</ol>\n<h2>Cloud computing</h2>\n<h3>Cloud computing models and services</h3>\n<ol>\n<li>Define cloud computing</li>\n<li>List the pros and cons of cloud computing.</li>\n<li>Distinguish between IaaS, PaaS and SaaS.</li>\n<li>Define mulit-tenancy. What is the difference between virtual and organic multi-tenancy?</li>\n<li>What is the difference betwwen horizontal scaling and vertical scaling? Describe scenarios in which you will use each type of scaling.</li>\n<li>Define virtualization. What is the difference between full, para- and hardware-ssisted virtualization?</li>\n</ol>\n<h3>Cloud concepts and technologies</h3>\n<ol>\n<li>What are the various layers in a virtualization architecture?</li>\n<li>What is the difference between full and para-virtualization?</li>\n<li>What are the benefits of load balancing?</li>\n<li>What are sticky sessions?</li>\n<li>What are the difference between traditional and on-demand scaling approaches?</li>\n<li>What are the various stages in the deployment lifecycle?</li>\n<li>hat is the difference between array-based and host-based replication?</li>\n<li>In MapReduce, what are the functions of map, reduce and combine tasks?</li>\n<li>Describe three applications that can benefit from the MapReduce programming model?</li>\n<li>What are the various criteria for service level agreements?</li>\n</ol>","excerpt":"Internet of Things (IoT) / Web of Things (WoT) Describe an example of an IoT system in witch information and knowledge are inferred from…","frontmatter":{"date":"November 26, 2018","dateUnformatted":"2018-11-26","path":"/questions/iot","title":"IoT Questions","tags":"questions","author":"Kristoffer-Andre Kalliainen","ogDescription":"IoT Questions"}}},"pageContext":{}}