{"data":{"markdownRemark":{"html":"<h2>Reading Lists for the Exam</h2>\n<ul>\n<li>Chapter 1: Bagha and Madisetti: Internet of Things - A Hands-On Approach. (hardcopy handed out)</li>\n<li><a href=\"https://vs.inf.ethz.ch/publ/papers/Internet-of-things.pdf\">Mattern and Floerkemeier: From the Internet of Computers to the Internet of Things</a></li>\n<li><a href=\"http://cs2.ist.unomaha.edu/~stanw/161/csci4500/embedded.pdf\">Chapter 1: Programming Embedded Systems in C and C++</a></li>\n<li>Chapter 5 and 6 in Guinard and Trifa: Building the Web of Things (hardcopy handed out)</li>\n<li><a href=\"https://csrc.nist.gov/projects/cloud-computing\">NIST Cloud Computing</a></li>\n<li>Arshdeep Bahga and Vijay Madisetti. Cloud Computing: A Hands-On-Approach. (Chapters 1 and 2) – (Hardcopy handed out)</li>\n<li>Fink, G. A. et al.(2015). Security and privacy grand challenges for the Internet of Things. In IEEE International Conference on Collaboration Technologies and Systems (CTS), (pp. 27-34).</li>\n<li>Lectures notes, practice questions, and hands-on assignments A,B, and C</li>\n</ul>\n<h2>Exam structure</h2>\n<p>In the examination of the IoT module, you will draw 1 topic and be expected to present the most important points within 4-5 minutes. </p>\n<p>In addition, you will be given a few questions on other topics related to IoT and Cloud. Here only relatively short answers are expected. </p>\n<h2>The topics</h2>\n<ul>\n<li>IoT, IoT system architecture, IoT devices, characteristics</li>\n<li>Embedded systems, sensors, actuators, microcontrollers, digital and analog input/output</li>\n<li>Embedded system/software development, hardware/software co-design, programming model</li>\n<li>IoT protocols: IP, UDP/TCP, HTTP, CoAP, WebSockets</li>\n<li>Web-of-things: REST APIs, publish-subscribe messaging and MQTT</li>\n<li>Cloud computing: Characteristics, service models, deployment models, storage/compute and relevant technologies</li>\n<li>Security in IoT: Design challenges and threats of IoT systems</li>\n</ul>\n<p><strong>The total examination time for this module is ~10 minutes. You are allowed to have 1-2 sheets of paper sheets with notes and consult these occasionally</strong></p>","excerpt":"Reading Lists for the Exam Chapter 1: Bagha and Madisetti: Internet of Things - A Hands-On Approach. (hardcopy handed out) Mattern and…","frontmatter":{"date":"November 26, 2018","dateUnformatted":"2018-11-26","path":"/exam-details/iot","title":"Examination details for IoT Module","tags":"exam-details","author":"Kathinka Neteland","ogDescription":"Examination details for IoT Module"}}},"pageContext":{}}