{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Characteristics of Cloud Computing On-demand self service Cloud computing resources can be provisioned on-demand by the users, without requiring interactons with the cloud service provider. The process of provisioning resources is automated. Broad network access Cloud computing resources can be accessed over the network using standard access mechanisms that provide platform-independent…","id":"6ad1d946-9410-520d-a1b5-8bedd8394199","timeToRead":5,"frontmatter":{"date":"Dec 04, 2018","path":"/iot/cloud-computing","title":"Cloud Computing","author":"Kristoffer-Andre Kalliainen","tags":"iot"}}},{"node":{"excerpt":"How is a payment carried out in the Bitcoin network? The bitcoin network is based on blocks. Blocks are discovered by attempting to solve complex mathematical problems using huge computational resources. Once a block is “discovered”, the block is validated by consensus of peers in the network. They will adopt the new block. The node that discovers the block will get a reward, but it will…","id":"e6d39178-aaa9-5e5d-ae28-8fa786bbdb8b","timeToRead":4,"frontmatter":{"date":"Dec 03, 2018","path":"/questions/blockchain","title":"Blockchain Questions","author":"Kristoffer-Andre Kalliainen, Vegard Guttormsen and Preben Haukebøe","tags":"questions"}}},{"node":{"excerpt":"Concepts IoT (Internet of Things) The Internet of Things (IoT) is a system of interrelated computing devices, mechanical and digital machines, objects, animals or people that are provided with unique identifiers and the ability to transfer data over a network without requiring human-to-human or human-to-computer interaction. In the Internet of Things, all the things that are being…","id":"052c5034-5a72-534f-b9c5-444be2c53863","timeToRead":9,"frontmatter":{"date":"Dec 01, 2018","path":"/iot/iot","title":"Internet of Things","author":"Kristoffer-Andre Kalliainen","tags":"iot"}}},{"node":{"excerpt":"Reading Lists for the Exam Chapter 1: Bagha and Madisetti: Internet of Things - A Hands-On Approach. (hardcopy handed out) Mattern and Floerkemeier: From the Internet of Computers to the Internet of Things Chapter 1: Programming Embedded Systems in C and C++ Chapter 5 and 6 in Guinard and Trifa: Building the Web of Things (hardcopy handed out) NIST Cloud Computing Arshdeep Bahga and…","id":"6e0f4165-685a-5176-8884-79686beea6ed","timeToRead":1,"frontmatter":{"date":"Nov 26, 2018","path":"/exam-details/iot","title":"Examination details for IoT Module","author":"Kathinka Neteland","tags":"exam-details"}}},{"node":{"excerpt":"Internet of Things (IoT) / Web of Things (WoT) Cloud computing Cloud computing models and services Define cloud computing List the pros and cons of cloud computing. Distinguish between IaaS, PaaS and SaaS. Define mulit-tenancy. What is the difference between virtual and organic multi-tenancy? What is the difference betwwen horizontal scaling and vertical scaling? Describe scenarios in…","id":"603b291f-4792-5944-8acb-ed36b3bc9dd3","timeToRead":1,"frontmatter":{"date":"Nov 26, 2018","path":"/questions/iot","title":"IoT Questions","author":"Kristoffer-Andre Kalliainen","tags":"questions"}}}]}},"pageContext":{}}